## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                           |
|----------|-----------------------------------------------------------------------------------------|
| update   | `aws_lb_listener.form_viewer_https`                                                     |
| recreate | `aws_acm_certificate.form_viewer`                                                       |
| add      | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-formulaires.canada.ca&quot;]`  |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-staging.cdssandbox.xyz&quot;]` |
| delete   | `aws_route53_record.form_viewer_certificate_validation[&quot;0&quot;]`                            |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;1&quot;]`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.form_viewer must be replaced
+/- resource "aws_acm_certificate" "form_viewer" {
      ~ arn                       = "arn:aws:acm:ca-central-1:687401027353:certificate/06cc7e5e-6aac-4477-bae5-b0409d6da2f6" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "forms-staging.cdssandbox.xyz"
              - resource_record_name  = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws."
            },
          + {
              + domain_name           = "forms-formulaires.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "forms-staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:687401027353:certificate/06cc7e5e-6aac-4477-bae5-b0409d6da2f6" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "forms-formulaires.canada.ca",
        ]
        tags                      = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ validation_emails         = [] -> (known after apply)
        # (3 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:687401027353:certificate/06cc7e5e-6aac-4477-bae5-b0409d6da2f6" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:687401027353:listener/app/form-viewer/5e6bc2d9ab810b68/028e8eeeed9c3a34"
        tags              = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer_certificate_validation["0"] will be destroyed
  # (because key ["0"] is not in for_each map)
  - resource "aws_route53_record" "form_viewer_certificate_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> null
      - id              = "Z05990652HOQ0SGHD81ZC__42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz._CNAME" -> null
      - name            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> null
      - records         = [
          - "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z05990652HOQ0SGHD81ZC" -> null
    }

  # aws_route53_record.form_viewer_certificate_validation["1"] will be destroyed
  # (because key ["1"] is not in for_each map)
  - resource "aws_route53_record" "form_viewer_certificate_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz.forms-formulaires.canada.ca" -> null
      - id              = "Z10455362UNR7HEX7QJTL__42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz._CNAME" -> null
      - name            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> null
      - records         = [
          - "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z10455362UNR7HEX7QJTL" -> null
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-formulaires.canada.ca"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z10455362UNR7HEX7QJTL"
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-staging.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05990652HOQ0SGHD81ZC"
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
